# while 迴圈
# 條件式迴圈, 當條件成立時執行迴圈內程式
i = 1
while i < 10:
    # 當i小於10時執行
    print(i)
    i = i + 1

# 算術指定運算子
# +=, -=, *=, /=, %=, **=, //=
# X = X + 1 等於 X += 1
# X = X - 1 等於 X -= 1
# X = X * 1 等於 X *= 1
# X = X / 1 等於 X /= 1
# X = X % 1 等於 X %= 1
# X = X ** 1 等於 X **= 1
# X = X // 1 等於 X //= 1

# 符號優先順序
# 1. () 先執行括號內的運算式
# 2. ** 指數運算
# 3. + - 正負號
# 4. * / // % 乘除法, 取餘數, 整數除法
# 5. + - 加減法
# 6. == != > < >= <= 比較運算
# 7. and or not 邏輯運算
# 8. = += -= *= /= %= //= **=

i = 1
while i < 10:
    # 當i小於10時執行
    print(i)
    i += 1  # 等於i = i + 1

n = int(input("請輸入密碼："))

while n != 1214:
    n = int(input("請輸入密碼："))
print("歡迎光臨")
